In [1]:
import pandas as pd
import numpy as np

In [2]:
deaths = pd.read_csv("deaths.csv")
pumps = pd.read_csv("pumps.csv")
dates = pd.read_csv("snow_dates.csv")

In [3]:
deaths.head()

   death_count  x_latitude  y_longitude
0            1   51.513418    -0.137930
1            1   51.513418    -0.137930
2            1   51.513418    -0.137930
3            1   51.513361    -0.137883
4            1   51.513361    -0.137883

In [8]:
deaths.death_count.value_counts()

death_count
1    489
Name: count, dtype: int64

In [7]:
pumps

        pump_name  x_coordinate  y_coordinate
0       Broad St.     51.513341     -0.136668
1    Crown Chapel     51.513876     -0.139586
2  Gt Marlborough     51.514906     -0.139671
3        Dean St.     51.512354     -0.131630
4         So Soho     51.512139     -0.133594
5     Briddle St.     51.511542     -0.135919
6    Coventry St.     51.510019     -0.133962
7         Warwick     51.511295     -0.138199

In [5]:
dates.head()

   order        date  attacks  deaths
0      1  1854-08-19        1       1
1      2  1854-08-20        1       0
2      3  1854-08-21        1       2
3      4  1854-08-22        0       0
4      5  1854-08-23        1       0

In [6]:
dates.tail()

    order        date  attacks  deaths
38     39  1854-09-26        1       2
39     40  1854-09-27        1       0
40     41  1854-09-28        0       2
41     42  1854-09-29        0       1
42     43  1854-09-30        0       0